import { DiscriminationEntry } from '../types';

export const discriminations: DiscriminationEntry[] = [
  {
    id: 'd1',
    words: ['安静', '宁静'],
    content: '“安静”重在稳定，有使安稳平静下来的意思。例如：１、请大家安静一下！２、上课铃响了，教室里渐渐安静下来。它有一个由喧闹到安静下来的过程。“宁静”重在平和，一般多指环境或心情平和安静，它描述的是一种很安静的状态或气氛。例如：清晨，公园里十分宁静。“宁静”是高于“安静”的一种情境，除了指环境外，更多的时候是指一种心情上的安宁，是人们追求的不受外界干扰的有质量的生活境界。',
    type: 'discrimination'
  },
  {
    id: 'd2',
    words: ['毕竟', '究竟'],
    content: '“毕竟”用在肯定句中，强调原因或结果；“究竟”可以用于疑问句中，追究事情的本相，而“毕竟”不能。',
    type: 'discrimination'
  },
  {
    id: 'd3',
    words: ['缺乏', '缺少'],
    content: '“缺乏”有三类：⑴抽象名词，如“经验、信心、勇气、积极性、上进心”等；⑵行为动词，如“锻炼、研究、观察、调查”等；⑶表示集合概念的名词，如“人员、书籍、车辆、弹药、雨水”等。另外，“缺乏”的对象前面，一般不用数量词指出具体数量，也不容易指出具体数量。“缺少”：多用于具体的可以计数的人或物，跟它搭配的词，常见的是具体名词，如“人、钱、图书、机器”等；有时也用于抽象事物“信心、经验、文化”等。',
    type: 'discrimination'
  },
  {
    id: 'd4',
    words: ['法制', '法治'],
    content: '法制：名词，法律制度。法治：名词或动词，依法治理国家的思想、方法。',
    type: 'discrimination'
  },
  {
    id: 'd5',
    words: ['妨害', '妨碍'],
    content: '妨害：使受损害。如“妨害健康”、“妨害要表达的义理”。妨碍：使不能顺利进行，如“妨碍交通”、“妨碍政策的实施”。',
    type: 'discrimination'
  },
  {
    id: 'd6',
    words: ['肤浅', '浮浅'],
    content: '肤浅：人的（学识）浅，对事物理解不深。浮浅：（思想作风、文章风格）浅薄、不切实。',
    type: 'discrimination'
  }
];
